In [2]:
import numpy as np
import pandas as pd

ModuleNotFoundError: No module named 'numpy'

In [ ]:
# df = np.random.randint(0, 100, 30)
# pd.DataFrame(df)
# np.reshape(df, (5, 6))

In [ ]:
df = pd.DataFrame(np.random.randint(1, 100, 30).reshape(5, 6), columns=['A', 'B', 'C', 'D', 'E', 'F'], index=['G', 'H', 'I', 'J', 'K'])
df

    A   B   C   D   E   F
G  78  91  28  38  19  86
H  23  88  87  97  28  22
I  49  55  37  56  13  94
J  81  21   2  19  74  15
K  70  47  27  91  99  42

In [ ]:
df1 = pd.DataFrame(np.arange(0, 30).reshape(5, 6), columns=['A', 'B', 'C', 'D', 'E', 'F'], index=['G', 'H', 'I', 'J', 'K'])
df1

    A   B   C   D   E   F
G   0   1   2   3   4   5
H   6   7   8   9  10  11
I  12  13  14  15  16  17
J  18  19  20  21  22  23
K  24  25  26  27  28  29

In [ ]:
df2 = pd.DataFrame(data = [[1, 3, 5], [2, 4, 6], [6, 8, 9]] )
df2

   0  1  2
0  1  3  5
1  2  4  6
2  6  8  9

In [ ]:
df.head(2) # first 2 rows

    A   B   C   D   E   F
G  78  91  28  38  19  86
H  23  88  87  97  28  22

In [ ]:
df.tail(3) # last 3 rows

    A   B   C   D   E   F
I  49  55  37  56  13  94
J  81  21   2  19  74  15
K  70  47  27  91  99  42

In [ ]:
type(df)

pandas.core.frame.DataFrame

In [ ]:
df.info() # info about the dataframe

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, G to K
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int32
 1   B       5 non-null      int32
 2   C       5 non-null      int32
 3   D       5 non-null      int32
 4   E       5 non-null      int32
 5   F       5 non-null      int32
dtypes: int32(6)
memory usage: 160.0+ bytes

In [ ]:
df.describe() # statistical summary of the dataframe

               A          B          C          D          E          F
count   5.000000   5.000000   5.000000   5.000000   5.000000   5.000000
mean   60.200000  60.400000  36.200000  60.200000  46.600000  51.800000
std    24.263141  29.407482  31.236197  33.581245  37.858949  36.362068
min    23.000000  21.000000   2.000000  19.000000  13.000000  15.000000
25%    49.000000  47.000000  27.000000  38.000000  19.000000  22.000000
50%    70.000000  55.000000  28.000000  56.000000  28.000000  42.000000
75%    78.000000  88.000000  37.000000  91.000000  74.000000  86.000000
max    81.000000  91.000000  87.000000  97.000000  99.000000  94.000000

**INDEXING**
1. Column Name
2. Row index(loc)
3. Row index & column index number(iloc)

In [ ]:
df[['A', 'B']]

    A   B
G  78  91
H  23  88
I  49  55
J  81  21
K  70  47

In [ ]:
df['C']

G    28
H    87
I    37
J     2
K    27
Name: C, dtype: int32

In [ ]:
type(df['C']) # single column is a series

pandas.core.series.Series

In [ ]:
df.loc[['G', 'H']] # row with label G, H (dataframe)

    A   B   C   D   E   F
G  78  91  28  38  19  86
H  23  88  87  97  28  22

In [ ]:
df.loc['G'] # row with label G (series)

A    78
B    91
C    28
D    38
E    19
F    86
Name: G, dtype: int32

In [ ]:
df.iloc[2:4, 1:3] # rows 2, 3, columns 1, 2 (dataframe)

    B   C
I  55  37
J  21   2

In [ ]:
df.isnull().sum() # check for null values

A    0
B    0
C    0
D    0
E    0
F    0
dtype: int64

In [ ]:
df['B'].value_counts() # count of unique values in column B

91    1
88    1
55    1
21    1
47    1
Name: B, dtype: int64

In [ ]:
df['B'].unique() # unique values in column G

array([91, 88, 55, 21, 47])

**CONCATING DATAFRAMES**

In [ ]:
classA = pd.DataFrame({'Name': ['Aryan', 'Ojshav', 'Neetesh', 'Mayank'], 'Subject': ['Maths', 'English', 'Science', 'Hindi'], 'Marks': [90, 80, 70, 42]})
classB = pd.DataFrame({'Name': ['Aryan2', 'Ojshav2', 'Neetesh2', 'Mayank2'], 'Subject': ['Maths', 'English2', 'Science2', 'Hindi2'], 'Marks': [70, 60, 50, 33]})
classC = pd.DataFrame({'Name': ['Aryan3', 'Ojshav3', 'Neetesh3', 'Mayank3'], 'Subject': ['Maths2', 'English', 'Science3', 'Hindi3'], 'Marks': [80, 50, 40, 20]})
classD = pd.DataFrame({'Name': ['Aryan4', 'Ojshav4', 'Neetesh4', 'Mayank4'], 'Subject': ['Maths3', 'English3', 'Science', 'Hindi4'], 'Marks': [90, 80, 50, 10]})

pd.concat([classA, classB, classC, classD], )

       Name   Subject  Marks
0     Aryan     Maths     90
1    Ojshav   English     80
2   Neetesh   Science     70
3    Mayank     Hindi     42
0    Aryan2     Maths     70
1   Ojshav2  English2     60
2  Neetesh2  Science2     50
3   Mayank2    Hindi2     33
0    Aryan3    Maths2     80
1   Ojshav3   English     50
2  Neetesh3  Science3     40
3   Mayank3    Hindi3     20
0    Aryan4    Maths3     90
1   Ojshav4  English3     80
2  Neetesh4   Science     50
3   Mayank4    Hindi4     10

In [ ]:
pd.concat([classA, classB, classC, classD], axis=1)

,Name,Subject,Marks,Name,Subject,Marks,Name,Subject,Marks,Name,Subject,Marks
0,Aryan,Maths,90,Aryan2,Maths,70,Aryan3,Maths2,80,Aryan4,Maths3,90
1,Ojshav,English,80,Ojshav2,English2,60,Ojshav3,English,50,Ojshav4,English3,80
2,Neetesh,Science,70,Neetesh2,Science2,50,Neetesh3,Science3,40,Neetesh4,Science,50
3,Mayank,Hindi,42,Mayank2,Hindi2,33,Mayank3,Hindi3,20,Mayank4,Hindi4,10

**MERGING DATAFRAMES**

In [ ]:
dataf1 = ({'key': ['K0', 'K1', 'K2', 'K3'], 'A': ['A0', 'A1', 'A2', 'A3'], 'B': ['B0', 'B1', 'B2', 'B3']})
dataf2 = ({'key': ['K1', 'K3', 'K4', 'K5'], 'C': ['C0', 'C1', 'C2', 'C3'], 'D': ['D0', 'D1', 'D2', 'D3']})

left = pd.DataFrame(dataf1)
right = pd.DataFrame(dataf2)

pd.merge(left, right)

  key   A   B   C   D
0  K1  A1  B1  C0  D0
1  K3  A3  B3  C1  D1